[
  {
    "id": "1729517129162",
    "content": "Dopo aver fatto alcune prove, sono arrivato ad analizzare la versione flattened del modello, sia del mio che del modello estratto dalla tesi. \nSi nota subito che il modello flattened estratto dalla tesi presenta un livello di annidamento molto più basso rispetto a al mio modello flattened.\n*Il problema potrebbe essere il numero di chiamate a macro call rule, il quale crea ripetute let a divide le condition rules*",
    "timestamp": "2024-10-21T13:25:29.162Z"
  },
  {
    "id": "1729415364141",
    "content": "Per la verifica viene utilizzato effettivamente NuSMV, non viene citato Proverif per la verifica del modello. \n\nIl modello si presenta effettivamente piú complicato di quello riguardando il mio progetto di ricerca, presenta funzioni monitored, funzioni con domini Prod multipli. Anche le rule si presentano con molti branch di esecuzione.",
    "timestamp": "2024-10-20T09:09:24.141Z"
  },
  {
    "id": "1729414796431",
    "content": "*Leggendo la tesi mi sorge lentamente il dubbio che lo scopo non sia fare verifica tramite NuSMV ma utilizzare invece Proverif utilizzando le clausole di horn*",
    "timestamp": "2024-10-20T08:59:56.431Z"
  },
  {
    "id": "1729371172687",
    "content": "Si inizia leggendo la tesi di gente venuta prima di me, che ha creato modelli piú complicati dei miei ma funzionanti. L' obiettivo é quello di trovare qual'é la differenza con i miei modelli e capire perché i miei risultano ugualmente piú complessi da gestire anche se meno complicati.",
    "timestamp": "2024-10-19T20:52:52.687Z"
  },
  {
    "id": "1729250016124",
    "content": "Le vie da percorrere per poter progredire con il progetto di ricerca sono essenzialmente due : \n\n- Progredire con lo sviluppo del framework per sviluppare e creare modelli ASM, in questo modo, avendo a disposizione un sistema piú affidabile per la creazione di modelli di smart contracts. Migliorare la mappatura al model checker NuSMV (**magari attraverso l'uso dell'esecuzione simbolica**);\n\n- Progredire con l'approfondimento dell'esecuzione simbolica per Ethereum (bytecode o Solidity) e una possibile mappatura diretta ad un model checker;\n\n- Cercare di alleggerire il modello e capire cosa renda cosí pesante la mappatura a NuSMV.",
    "timestamp": "2024-10-18T11:13:36.124Z"
  },
  {
    "id": "1729203681127",
    "content": "## DA QUESTO POST IN POI\n\nDa questo post in poi... si esplora la mia mente.\n\nSi apre come una scatola degli oggetti perduti\n\ndisordinata e malconcia, piena di bigiotteria e idee futili.\n\nNon c'è struttura in quello che scrivo\n\nma d'altronde\n\nquesto post fa parte di essa.\n\n\n**i testi in grassetto sono idee** ; *i testi in corsivo sono problemi*\n",
    "timestamp": "2024-10-17T22:21:21.127Z"
  }
]